{
    "book_title": "The Little Prince",
    "author": "Antoine de Saint-Exupéry",
    "context": "It took me a long time to understand where he came from. The little prince,\nwho asked me so many questions, never seemed to hear the ones I asked him.\nIt was things he said quite at random that, bit by bit, explained everything.\nFor instance, when he first caught sight of my airplane (I won't draw my\nairplane; that would be much too complicated for me) he asked:\n\"What's that thing over there?\"\n\"It's not a thing. It flies. It's an airplane. My airplane.\"\nAnd I was proud to tell him I could fly. Then he exclaimed:\n\"What! You fell out of the sky?\"\n\"Yes,\" I said modestly.\n\"Oh! That's funny...\" And the little prince broke into a lovely peal of\nlaughter, which annoyed me a good deal. I like my misfortunes to be taken\nseriously. Then he added, \"So you fell out of the sky, too. What planet are you\nfrom?\"\nThat was when I had the first clue to the mystery of his presence, and I\nquestioned him sharply.\n\"Do you come from another planet?\"\nBut he made no answer. He shook his head a little, still staring at my\nairplane.\n\"Of course, that couldn't have brought you from very far...\"\nAnd he fell into a reverie that lasted a long while. Then, taking my sheep\nout of his pocket, he plunged into contemplation of his treasure.\nYou can imagine how intrigued I was by this hint about \"other planets.\" I\ntried to learn more: \"Where do you come from, little fellow? Where is this\n'where I live' of yours? Where will you be taking my sheep?\"\nAfter a thoughtful silence he answered, \"The good thing about the crate\nyou've given me is that he can use it for a house after dark.\"\n\"Of course. And if you're good, I'll give you a rope to tie him up during the\nday. And a stake to tie him to.\"\nThis proposition seemed to shock the little prince. \"Tie him up? What a\nfunny idea!\"\n\"But if you don't tie him up, he'll wander off somewhere and get lost.\"\nMy friend burst out laughing again.\n\"Where could he go?\"\n\"Anywhere. Straight ahead...\"\nThen the little prince remarked quite seriously, \"Even if he did,\neverything's so small where I live!\" And he added, perhaps a little sadly,\n\"Straight ahead, you can't go very far."
}